Revit 2027 API
ParameterTypeId.SheetCurrentRevisionDate Property
 "Current Revision Date"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetCurrentRevisionDate { get; }
Public Shared ReadOnly Property SheetCurrentRevisionDate As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetCurrentRevisionDate {
	ForgeTypeId^ get ();
}
static member SheetCurrentRevisionDate : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace